//有n(n <= 100)个整数，已经按照从大到小顺序排列好，现在另外给一个整数m，请将该数插入到序列中，并使新的序列仍然有序。
//
//输入格式 :
//输入数据包含多个测试实例，每组数据由两行组成，第一行是n和m，第二行是已经有序的n个数的数列。n和m同时为0表示输入数据的结束，本行不做处理。
//
//输出格式 :
//对于每个测试实例，输出插入新的元素后的数列。
//
//输入样例 :
//3 3
//4 2 1
//0 0
//
//输出样例 :
//4 3 2 1

#include <stdio.h>
int a[105];
int main()
{
    int m, n;
    while (scanf("%d %d", &n, &m) == 2) {
        //结束条件
        if (n == 0 && m == 0)
            break;
        //读取数据
        for (int i = 0; i < n; i++)
            scanf("%d", &a[i]);
        //插入m
        //初始化m指针为z最小值的下标
        int z = n;
        for (int i = 0; i < n; i++) {
            if (m > a[i]) {
                z = i;
                break;
            }
        }
        //数组右移，空出m的位置
        for (int i = n; i > z; i--) {
            a[i] = a[i - 1];
        }
        a[z] = m;
        //输出数列
        for (int i = 0; i <= n; i++) {
            printf("%d", a[i]);
            if (i != n) printf(" ");
        }
        printf("\n");
    }
    return 0;
}