//输入N个整数，输出由这些整数组成的n行矩阵。
//
//输入格式 :
//第一行输入一个正整数N（N <= 20），表示后面要输入的整数个数。
//下面依次输入N个整数。
//
//输出格式 :
//以输入的整数为基础，输出有规律的N行数据。
//
//输入样例 :
//在这里给出一组输入。例如：
//5
//3 6 2 5 8
//
//输出样例 :
//在这里给出相应的输出。例如：
//3 6 2 5 8
//8 3 6 2 5
//5 8 3 6 2
//2 5 8 3 6
//6 2 5 8 3

#include <stdio.h>
int a[100];
int main()
{
    int n;
    scanf("%d", &n);
    //读取数据
    for (int i = 0; i < n; i++)
        scanf("%d", &a[i]);
    //分行输出
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            printf("%d", a[j]);
            if (j != n - 1)
                printf(" ");
        }
        //保证最后一行后不会换行
        if (i != n - 1)
            printf("\n");
        //数组移位
        int z = a[n - 1];
        for (int j = n - 1; j > 0; j--) {
            a[j] = a[j - 1];
        }
        a[0] = z;
    }
    return 0;

}
