//这是一个简版田忌赛马问题，具体如下：
//田忌与齐王赛马，双方各有n匹马参赛，每场比赛赌注为200两黄金，现已知齐王与田忌的每匹马的速度，并且齐王肯定是按马的速度从快到慢出场，请写一个程序帮助田忌计算他最多赢多少两黄金（若输，则用负数表示）。
//简单起见，保证2n匹马的速度均不相同。
//
//输入格式 :
//首先输入一个正整数T，表示测试数据的组数，然后是T组测试数据。
//每组测试数据输入3行，第一行是n（1≤n≤100) ，表示双方参赛马的数量，第2行n个正整数，表示田忌的马的速度，第3行n个正整数，表示齐王的马的速度。
//
//输出格式 :
//对于每组测试数据，输出一行，包含一个整数，表示田忌最多赢多少两黄金。
//
//输入样例 :
//4
//3
//92 83 71
//95 87 74
//2
//20 25
//21 12
//10
//1 2 3 24 5 6 7 8 9 12
//11 13 15 19 22 34 14 21 44 99
//4
//10 15 16 37
//14 20 30 40
//
//输出样例 :
//200
//400
//- 1200
//0

#include <stdio.h>
int a[110];
int b[110];
int main()
{
    int t;
    scanf("%d", &t);
    while (t--) {
        int n;
        scanf("%d", &n);
        for (int i = 0; i < n; i++)
            scanf("%d", &a[i]);
        for (int i = 0; i < n; i++)
            scanf("%d", &b[i]);
        //排序，将t和q的马的速度从大到小排序
        for (int i = 0; i < n - 1; i++) {
            for (int j = i + 1; j < n; j++) {
                if (a[i] < a[j]) {
                    int temp = a[i];
                    a[i] = a[j];
                    a[j] = temp;
                }
                if (b[i] < b[j]) {
                    int temp = b[i];
                    b[i] = b[j];
                    b[j] = temp;
                }
            }
        }
        //设置最快最慢马的指针
        int af = 0;
        int al = n - 1;
        int bf = 0;
        int bl = n - 1;
        int win = 0;
        for (int i = 0; i < n; i++) {
            //最快马比较
            if (a[af] > b[bf]) {
                win++;
                af++;
                bf++;
            }
            //最慢马比较
            else if (a[al] > b[bl]) {
                win++;
                al--;
                bl--;
            }
            //用最慢的马消耗最快的马
            else {
                if (a[al] < b[bf]) {
                    win--;
                }
                al--;
                bf++;
            }
        }
        printf("%d\n", win * 200);
    }
    return 0;
}