//对于一个n行n列的矩阵，先输入矩阵的行数，再依次输入矩阵的每行元素，判断该矩阵是否为对称矩阵，若矩阵对称输出“Yes."，不对称输出"No."。
//
//输入格式:
//输入有多组，每一组第一行输入一个正整数N（N <= 20），表示矩阵的行数（若N = 0，表示输入结束）。
//下面依次输入N行数据。
//
//输出格式 :
//若矩阵对称输出“Yes."，不对称输出”No.”。
//
//输入样例 :
//3
//6 3 12
//3 18 8
//12 8 7
//3
//6 9 12
//3 5 8
//12 6 3
//0
//
//输出样例 :
//Yes.
//No.

#include <stdio.h>
int a[30][30];
int main()
{
    int n;
    //必须检验有输入，否则会运行超时
    while (scanf("%d", &n) == 1 && n) {
        int f = 1;    //假设对称
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {
                scanf("%d", &a[i][j]);
            }
        }
        for (int i = 0; i < n; i++) {
            for (int j = i + 1; j < n; j++) {
                //不对称
                if (a[j][i] != a[i][j]) {
                    f = 0;
                    break;
                }
            }
        }
        if (f == 0)
            printf("No.\n");
        else
            printf("Yes.\n");
    }
    return 0;
}